app/Repositories/User/UserRepositoryImplement.php

update `users` set `name` = 'xzcvx', `email` = 'hope.dubuque@example.net', `password` = '{`K1>p+o,z', `users`.`updated_at` = '2023-06-19 15:47:51' where `id` = 5
---
    public function updateUserById(array $request, array $userById): array
    {
        try {
            $name = $request["name"] ?? "";
            $email = $request["email"] ?? "";
            $password = $request["password"] ?? "";

            if ($name == "") {
                $name = $userById["name"];
            }

            if ($email == "") {
                $email = $userById["email"];
            }

            if ($password == "") {
                $password = $userById["password"];
            }

            var_dump($userById["id"]);

            $this->model->where("id", $userById["id"])->update([
                "name" => $name,
                "email" => $email,
                "password" => $password
            ]);